const depts = {
  기계공학부: {
    desc:
      '기계공학부는 기계분야 산업현장의 수요에 능동적으로 대처해 나갈 수 있는 전문기술인을 양성하고 있다',
    subs: ['기계과', '기계설계과', '메카트로닉스과'],
  },
  수송기계공학부: {
    desc:
      '수송기계공학부에는 조선공학 관련 분야와 해양개발, 연안 환경 보존 등에 필요한 해양공학 분야의 전문기술인을 양성하는 조선해양과와 항공 및 항공 관련 기계산업에 관한 실무기술을 습득한다.',
    subs: ['조선해양과', '항공기계과', '자동차과'],
  },
  정보산업공학부: {
    desc:
      '정보산업공학부는 전기정보공학, 디지털전자공학, 정보통신공학 등 첨단 디지털 IT산업분야의 중견 기술 인력을 배출하는 취업 선도 학부이다.',
    subs: ['전기정보과', '디지털전자과', '정보통신과'],
  },
  컴퓨터정보공학부: {
    desc:
      '인하공업전문대학 컴퓨터정보공학부는 IT 융합시대를 선도할 경쟁력 있는 소프트웨어 및 Smart IT 인력 양성을 목표로 하고 있다.',
    subs: ['컴퓨터시스템과', '컴퓨터정보과'],
  },
  지구환경공학부: {
    desc:
      '지구환경공학부는 토목환경과와 항공지리정보과가 있으며 전문직업인 양성을 목표로 삼고 있습니다.',
    subs: ['토목환경과', '항공지리정보과'],
  },
  건축학부: {
    desc:
      '3년제로 구성되어 있는 건축학부의 건축과와 실내건축과는 ①창의성을 기반으로 하는 설계교육, ②다양한 디지털 매체를 활용한 입체적인 실무교육, ③시공실무 능력의 습득을 위한 장비 및 실습실 운영으로 21세기 정보화 디지털 시대에 적합한 우수한 건축 및 실내건축 전문가를 양성하고 있습니다.',
    subs: ['건축과', '실내건축과'],
  },
  신소재공학부: {
    desc:
      '신소재공학부에는 석유화학, 공장설계, 생명공학, 나노기술, 전자재료 및 환경기술에 대한 복합지식을 가진 전문기술인을 양성하는 화공환경과와 산업구조의 근간이되는 철강소재를 비롯하여 최첨단 전자재료 및 기능성 소재에 관한 전문기술인을 양성하는 금속재료과가 있으며 체계적으로 관련 이론을 교육하고 다양한 실험실습을 통하여 산업현장의 요구에 알맞은 직업인을 배출하고 있다.',
    subs: ['화공환경과', '금속재료과'],
  },
  서비스학부: {
    desc:
      '서비스 학부에서는 항공부문과 관광⋅호텔 및 비서직의 차별화 된 전문 인력을 양성하기 위하여 예절, 외국어, 실무교육에 다양한 교육콘텐츠 및 산학중점교수 등을 활용하여 현실적인 교육을 진행함으로써 각 서비스부문의 유능한 인재양성을 목표로 한다.',
    subs: ['항공운항과', '항공경영과', '관광경영과', '비서과', '호텔경영과'],
  },
  디자인학부: {
    desc:
      '디자인 분야 및 현장에서 종사할 인력양성을 위하여 디자인에 관한 기초디자인과 조형능력을 이론과 실습을 통하여 학습하고, 각 전공 디자인 분야에서 익힌 디자인 능력을 배양하여 실무에서 필요로 하는 창의적인 디자이너의 양성을 목표로 한다.',
    subs: ['산업디자인과', '패션디자인과'],
  },
  어학교양학부: {
    desc:
      '오늘날 세계화의 가속과 산업사회에서 지식 정보화 사회로의 문명 전환이라는 급격한 시대 변화를 겪고 있는 우리 사회는 특히 국제적 시야, 폭넓은 교양 및 전문적 실무능력을 갖춘 유능한 인재를 필요로 한다. 어학교양학부는 이러한 기술 발전과 사회 변화에 능동적으로 적응할 수 있는 인재양성을 위해 기본 교양 및 어학 과목의 교육을 통해 지성과 전문성 및 봉사정신을 두루 갖춘 유능한 인재양성을 교육의 목표로 한다.',
    subs: [],
  },
};

export default depts;
