const profs = {
  이성철: {
    연구실위치: '5호관 204호',
    연락처: '032-870-2134',
    담당과목: '기계가공법, 금형제작법, CNC밀링가공실습, CNC선반가공실',
  },
  고병갑: {
    연구실위치: '5호관 201호',
    연락처: '032-870-2135',
    담당과목: '재료역학, CAD실습, 3차원모델링실습, CAE실습',
  },
  함경춘: {
    연구실위치: '6호관 210호',
    연락처: '032-870-2152',
    담당과목: '재료역학, 설계강도시험, 설계신뢰성 시험, 기계재료',
  },
  엄기찬: {
    연구실위치: '6호관 209호',
    연락처: '032-870-2155',
    담당과목: '열역학, 유체역학, 공유압제어, PLC설계',
  },
  신흥열: {
    연구실위치: '5호관 401호',
    연락처: '032-870-2141',
    담당과목: '공기압제어실습, 유압제어실습',
  },
  신현재: {
    연구실위치: '5호관 402호',
    연락처: '032-870-2142',
    담당과목: 'PLC기초실습, PLC제어실습',
  },
  황수철: {
    연구실위치: '7호관 403호',
    연락처: '032-870-2331',
    담당과목: 'C프로그래밍, Visual C++응용, 지능형프로그래밍',
  },
  이세훈: {
    연구실위치: '7호관 305호',
    연락처: '032-870-2332',
    담당과목: '임베디드오픈플랫폼, 임베디드SW',
  },
  김동식: {
    연구실위치: '7호관 501호',
    연락처: '032-870-2334',
    담당과목: '기초전자개론, 컴퓨터구조',
  },
  박병섭: {
    연구실위치: '7호관 307호',
    연락처: '032-870-2335',
    담당과목: 'TCP/IP, USN 응용',
  },
  변창우: {
    연구실위치: '7호관 312호',
    연락처: '032-870-2336',
    담당과목: '자료구조, 데이터베이스설계 및 구축',
  },
  용승림: {
    연구실위치: '7호관 309호',
    연락처: '032-870-2337',
    담당과목: '정보보안개론, 네트워크보안',
  },
  김철진: {
    연구실위치: '7호관 510호',
    연락처: '032-870-2338',
    담당과목: '소프트웨어분석설계, 서버구축관리',
  },
  손병희: {
    연구실위치: '6호관 212호',
    연락처: '032-870-2333',
    담당과목: '모바일프로그래밍, 웹프로그래밍',
  },
};

export default profs;
