const sub_depts = {
  기계과: {
    desc:
      '산업의 토대를 이루는 기계분야의 전문기술인 양성을 목표로 하며, 기계 기초학문에서 응용학문에 이르기까지 이론과 실험·실습을 병행하여 강의가 진행된다.',
    profs: ['이성철', '고병갑'],
  },
  기계설계과: {
    desc:
      '기계설계분야의 자동화 및 전산화에 관한 이론과 기술교육에 중점을 두고 기계설계의 완숙한 계산 및 해석 능력을 배양하여 실제 산업 현장에서 제품의 생산성을 향상시킬 수 있는 능력을 갖춘 전문기술인 양성을 목표로 한다.',
    profs: ['함경춘', '엄기찬'],
  },
  메카트로닉스과: {
    desc:
      '메카트로닉스과에서는 각종 기계의 자동화 설계 및 자동화 기계를 운영할 수 있는 전문 기술인 양성을 목표로 기계와 전자에 관련된 최첨단 복합 종합기술인 메카트로닉스 관련 이론 강의 및 실습을 중점적으로 실시하고 있다.',
    profs: ['신흥열', '신현재'],
  },
  컴퓨터시스템과: {
    desc:
      'IT 산업의 경쟁력을 도약시키고자 정부, 기업 등이 협력하여 추진하는 차세대 IT 신성장동력 추진계획에 부응하여, 경쟁력 있는 실무형 유비쿼터스 IT 인력을 양성하고 있다.',
    profs: [
      '황수철',
      '이세훈',
      '김동식',
      '박병섭',
      '변창우',
      '용승림',
      '김철진',
      '손병희',
    ],
  },
};

export default sub_depts;
